# Reformat data to SQL

In [3]:
import pandas
import csv


def load_data(filename):
    data = pandas.read_csv(filename)
    data = data.rename(columns={"STATEFP": "state_id", "COUNTYFP": "county_id"})
    data = data.melt(id_vars=["state_id", "county_id"])
    data = data[data["value"].notnull()]
    return data


def save_data(data, filename):
    data = data[
        [
            "state_id",
            "county_id",
            "value",
            "start_date",
            "end_date",
            "source",
            "dataset",
        ]
    ]
    data.to_csv(
        filename,
        index=False,
        quoting=csv.QUOTE_NONNUMERIC,
        quotechar="'",
        line_terminator="),\n(",
    )
    return data

# People experiencing homelessness

In [4]:
data = load_data("../homelessness/output/homelessness.csv")
data["start_date"] = "2019-01-01"
data["end_date"] = "2019-12-31"
data["source"] = 17 # Housing and Urban Development
data["dataset"] = 92 # homeless_per_10000
data = save_data(data, "output/homeless_reformatted.csv")
data

      state_id  county_id  value  start_date    end_date  source  dataset
0            2         13  26.07  2019-01-01  2019-12-31      17       92
1            2         16  26.07  2019-01-01  2019-12-31      17       92
2            2         20  26.07  2019-01-01  2019-12-31      17       92
3            2         50  26.07  2019-01-01  2019-12-31      17       92
4            2         60  26.07  2019-01-01  2019-12-31      17       92
...        ...        ...    ...         ...         ...     ...      ...
3215        56         37   9.47  2019-01-01  2019-12-31      17       92
3216        56         39   9.47  2019-01-01  2019-12-31      17       92
3217        56         41   9.47  2019-01-01  2019-12-31      17       92
3218        56         43   9.47  2019-01-01  2019-12-31      17       92
3219        56         45   9.47  2019-01-01  2019-12-31      17       92

[3220 rows x 7 columns]

## Mortality

In [5]:
metadata = pandas.DataFrame(
    data={
        "variable": [
            "deaths_0-5_all",
            "deaths_5-25_all",
            "deaths_25+_all",
            "deaths_25+_circ",
            "deaths_25+_resp",
            "mort_0-5_all",
            "mort_0-5_all_est",
            "mort_5-25_all",
            "mort_5-25_all_est",
            "mort_25+_all",
            "mort_25+_all_est",
            "mort_25+_circ",
            "mort_25+_circ_est",
            "mort_25+_resp",
            "mort_25+_resp_est",
        ],
        "dataset": [
            70,
            71,
            72,
            73,
            74,
            75,
            76,
            77,
            78,
            79,
            80,
            81,
            82,
            83,
            84,
        ],
    }
)

data = load_data("input/mortality.csv")
data["source"] = 13  # cdc
data["start_date"] = "2016-01-01"
data["end_date"] = "2016-12-31"
data = data = data.merge(metadata)
data = save_data(data, "output/mortality_reformatted.csv")
data

       state_id  county_id   value  start_date    end_date  source  dataset
0             1          1  157.00  2016-01-01  2016-12-31      13       73
1             1          3  631.00  2016-01-01  2016-12-31      13       73
2             1          5   81.00  2016-01-01  2016-12-31      13       73
3             1          7   73.00  2016-01-01  2016-12-31      13       73
4             1          9  184.00  2016-01-01  2016-12-31      13       73
...         ...        ...     ...         ...         ...     ...      ...
32605        56         37    0.45  2016-01-01  2016-12-31      13       78
32606        56         39    0.45  2016-01-01  2016-12-31      13       78
32607        56         41    0.45  2016-01-01  2016-12-31      13       78
32608        56         43    0.45  2016-01-01  2016-12-31      13       78
32609        56         45    0.45  2016-01-01  2016-12-31      13       78

[32610 rows x 7 columns]

## PM 2.5

In [6]:
data = load_data("input/climate.csv")
data = data[data["variable"] == "PM2_5"]
data["start_date"] = "2015-01-01"
data["end_date"] = "2015-12-31"
data["source"] = 12 # NASA Earth
data["dataset"] = 69 # PM2_5
data = save_data(data, "output/climate_reformatted.csv")
data

        state_id  county_id  value  start_date    end_date  source  dataset
302680        29        227   7.86  2015-01-01  2015-12-31      12       69
302681        31         61   6.26  2015-01-01  2015-12-31      12       69
302682        36         13   7.82  2015-01-01  2015-12-31      12       69
302683        37        181   8.84  2015-01-01  2015-12-31      12       69
302684        47        183   8.30  2015-01-01  2015-12-31      12       69
...          ...        ...    ...         ...         ...     ...      ...
305817        40         91   6.82  2015-01-01  2015-12-31      12       69
305818        40         95   6.35  2015-01-01  2015-12-31      12       69
305819        48        225   9.38  2015-01-01  2015-12-31      12       69
305820        48        407   8.39  2015-01-01  2015-12-31      12       69
305821        48        395   9.31  2015-01-01  2015-12-31      12       69

[3108 rows x 7 columns]

## Energy Expenditure

In [7]:
metadata = pandas.DataFrame(
    data={
        "variable": [
            "energy_expenditure_per_capita",
            "transportation_energy_expenditure_per_capita",
            "residential_energy_expenditure_per_capita",
            "energy_expenditure_share_of_gdp",
            "transportation_energy_expenditure_share_of_gdp",
            "residential_energy_expenditure_share_of_gdp",
        ],
        "dataset": [
            85,
            87,
            86,
            88,
            90,
            89,
        ],
    }
)
data = load_data("input/energy.csv")
data = data.merge(metadata)
data = data.drop(columns=["variable"])
data["start_date"] = "2018-01-01"
data["end_date"] = "2018-12-31"
data["source"] = 14  # U.S. Energy Information Administration
data = save_data(data, "output/energy_reformatted.csv")
data

,state_id,county_id,value,start_date,end_date,source,dataset
0,2,13,7793.051771,2018-01-01,2018-12-31,14,85
1,2,16,7793.051771,2018-01-01,2018-12-31,14,85
2,2,20,7793.051771,2018-01-01,2018-12-31,14,85
3,2,50,7793.051771,2018-01-01,2018-12-31,14,85
4,2,60,7793.051771,2018-01-01,2018-12-31,14,85
...,...,...,...,...,...,...,...
18847,56,37,0.013075,2018-01-01,2018-12-31,14,89
18848,56,39,0.013075,2018-01-01,2018-12-31,14,89
18849,56,41,0.013075,2018-01-01,2018-12-31,14,89
18850,56,43,0.013075,2018-01-01,2018-12-31,14,89
18851,56,45,0.013075,2018-01-01,2018-12-31,14,89

## Critical Habitat

In [8]:
data = load_data("input/climate.csv")
data = data[data["variable"] == "PerCritHab"]
data["start_date"] = "2021-01-01"
data["end_date"] = "2021-12-31"
data["source"] = 16 # fish and wildlife service
data["dataset"] = 91 # critical_habitat
data = save_data(data, "output/critical_habitat_reformatted.csv")
data

        state_id  county_id  value  start_date    end_date  source  dataset
299460        29        227    0.0  2021-01-01  2021-12-31      16       91
299461        31         61    0.0  2021-01-01  2021-12-31      16       91
299462        36         13    0.0  2021-01-01  2021-12-31      16       91
299463        37        181    0.0  2021-01-01  2021-12-31      16       91
299464        47        183    0.0  2021-01-01  2021-12-31      16       91
...          ...        ...    ...         ...         ...     ...      ...
302597        40         91    0.0  2021-01-01  2021-12-31      16       91
302598        40         95    0.0  2021-01-01  2021-12-31      16       91
302599        48        225    0.0  2021-01-01  2021-12-31      16       91
302600        48        407    0.0  2021-01-01  2021-12-31      16       91
302601        48        395    0.0  2021-01-01  2021-12-31      16       91

[3142 rows x 7 columns]

# Population (US Census 5 year ACS, 2019)

In [14]:
data = load_data("input/population_2019.csv")
data["start_date"] = "2019-01-01"
data["end_date"] = "2019-12-31"
data["source"] = 6 # US Census Bureau
data["dataset"] = 93 # population
data = save_data(data, "output/population_reformatted.csv")
data

      state_id county_id     value  start_date    end_date  source  dataset
0           17       051    7737.0  2019-01-01  2019-12-31       6       93
1           17       107   10797.0  2019-01-01  2019-12-31       6       93
2           17       165    9972.0  2019-01-01  2019-12-31       6       93
3           17       097  246122.0  2019-01-01  2019-12-31       6       93
4           17       127    5822.0  2019-01-01  2019-12-31       6       93
...        ...       ...       ...         ...         ...     ...      ...
2899        47       033    5491.0  2019-01-01  2019-12-31       6       93
2900        47       095    2243.0  2019-01-01  2019-12-31       6       93
2901        47       093  187319.0  2019-01-01  2019-12-31       6       93
2902        53       005   72121.0  2019-01-01  2019-12-31       6       93
2903        53      011]  174661.0  2019-01-01  2019-12-31       6       93

[2827 rows x 7 columns]